#### Terraform Plan ��
```hcl
[0m[1mdata.aws_iam_policy_document.cert_manager_permissions: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-lab-cluster/cluster][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_iam_role.external_dns: Refreshing state... [id=external-dns-role][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Reading...[0m[0m
[0m[1maws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::022239501643:policy/ExternalDnsPolicy][0m
[0m[1mmodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075f9054a8bb97b1e][0m
[0m[1maws_iam_role_policy_attachment.attach: Refreshing state... [id=external-dns-role-2025072915470702880000000f][0m
[0m[1mdata.aws_iam_policy_document.cert_manager_permissions: Read complete after 0s [id=3084690586][0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.external_dns_permissions: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mdata.aws_iam_policy_document.external_dns_permissions: Read complete after 0s [id=3488776268][0m
[0m[1maws_iam_policy.cert_manager_iam_policy: Refreshing state... [id=arn:aws:iam::022239501643:policy/CertManagerPolicy][0m
[0m[1mmodule.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002][0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=022239501643][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role.this[0]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-20250729154027305400000003][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=022239501643][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027654300000005][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027662700000006][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027745400000009][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027707000000007][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027729300000008][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027644000000004][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=022239501643][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2335649184][0m
[0m[1mmodule.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=84ec1dc0-cbe3-4437-94e5-6887d46d32c4][0m
[0m[1mmodule.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-lab-cluster][0m
[0m[1mmodule.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-ClusterEncryption2025072915404971350000000d][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-2025072915405000570000000e][0m
[0m[1mmodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cca2926dd98cc1c5][0m
[0m[1mmodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04252fc376756582f][0m
[0m[1mmodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-046c8775512d9d0eb][0m
[0m[1mmodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ff47f84032f6c21a][0m
[0m[1mmodule.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f66cca4b3321079c][0m
[0m[1mmodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0193772631b1ad52f][0m
[0m[1mmodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00b18fe791c2d3150][0m
[0m[1mmodule.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e393813715091302][0m
[0m[1mmodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01c32044b41941374][0m
[0m[1mmodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-046c8775512d9d0eb1080289494][0m
[0m[1mmodule.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3077616095][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4027046276][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3564338376][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-489757534][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3695526873][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3341762793][0m
[0m[1mmodule.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2176089151][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4271088000][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2744021794][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1415084651][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3072711406][0m
[0m[1mmodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06bf7a153f305992c][0m
[0m[1mmodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b61278aae9b960fb][0m
[0m[1mmodule.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-lab-cluster][0m
[0m[1mmodule.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.time_sleep.this[0]: Refreshing state... [id=2025-07-29T15:47:36Z][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Reading...[0m[0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8524188774829411902][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-04b146a3edeef80f8][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-lab-cluster:spot_nodes-20250729163847137900000003][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy][0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Read complete after 0s [id=77f878887104bc97ce87a3d0fe39312e6535df5b][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F][0m
[0m[1mmodule.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1mdata.aws_iam_policy_document.external_dns_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.cert_manager_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.external_dns_assume_role: Read complete after 0s [id=2706700323][0m
[0m[1mdata.aws_iam_policy_document.cert_manager_assume_role: Read complete after 0s [id=2648103222][0m
[0m[1maws_iam_role.cert_manager_iam_role: Refreshing state... [id=cert-manager-role][0m
[0m[1mmodule.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-lab-cluster:vpc-cni][0m
[0m[1mmodule.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-lab-cluster:coredns][0m
[0m[1mmodule.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-lab-cluster:kube-proxy][0m
[0m[1maws_iam_role_policy_attachment.cert_manager_attachment: Refreshing state... [id=cert-manager-role-20250729163841773500000002][0m
[0m[1maws_eks_access_entry.eks_deployer_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-eks-deployer][0m
[0m[1maws_eks_access_entry.root_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:root][0m
[0m[1maws_eks_access_policy_association.root_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_policy_association.eks_deployer_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-eks-deployer#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0][0m has changed
[0m  [33m~[0m[0m resource "aws_eks_node_group" "this" {
        id                     = "eks-lab-cluster:spot_nodes-20250729163847137900000003"
      [32m+[0m[0m labels                 = {}
        tags                   = {
            "Name" = "spot_nodes"
        }
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # aws_iam_policy.cert_manager_iam_policy[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_policy" "cert_manager_iam_policy" {
        id               = "arn:aws:iam::022239501643:policy/CertManagerPolicy"
        name             = "CertManagerPolicy"
      [33m~[0m[0m policy           = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m Statement = [
                    {
                        Action   = "route53:ChangeResourceRecordSets"
                        Effect   = "Allow"
                        Resource = "arn:aws:route53:::hostedzone/*"
                        Sid      = "ChangeRecordsInZones"
                    },
                  [33m~[0m[0m {
                      [33m~[0m[0m Action   = [
                          [31m-[0m[0m "route53:ListTagsForResource",
                            "route53:ListResourceRecordSets",
                          [31m-[0m[0m "route53:ListHostedZonesByVPC",
                          [31m-[0m[0m "route53:ListHostedZonesByName",
                            "route53:ListHostedZones",
                          [31m-[0m[0m "route53:GetHostedZone",
                          [32m+[0m[0m "route53:GetChange",
                        ]
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    },
                ]
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        )
        tags             = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_policy.external_dns_iam_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "external_dns_iam_policy" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "ExternalDnsPolicy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "route53:ChangeResourceRecordSets"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:route53:::hostedzone/*"
                      [32m+[0m[0m Sid      = "ChangeRecordsInZones"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "route53:ListTagsForResource",
                          [32m+[0m[0m "route53:ListResourceRecordSets",
                          [32m+[0m[0m "route53:ListHostedZonesByVPC",
                          [32m+[0m[0m "route53:ListHostedZonesByName",
                          [32m+[0m[0m "route53:ListHostedZones",
                          [32m+[0m[0m "route53:GetHostedZone",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "ReadAllZones"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
    }

[1m  # aws_iam_policy.external_dns_policy[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_policy.external_dns_policy is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_policy" "external_dns_policy" {
      [31m-[0m[0m arn              = "arn:aws:iam::022239501643:policy/ExternalDnsPolicy" [90m-> null[0m[0m
      [31m-[0m[0m attachment_count = 1 [90m-> null[0m[0m
      [31m-[0m[0m id               = "arn:aws:iam::022239501643:policy/ExternalDnsPolicy" [90m-> null[0m[0m
      [31m-[0m[0m name             = "ExternalDnsPolicy" [90m-> null[0m[0m
      [31m-[0m[0m path             = "/" [90m-> null[0m[0m
      [31m-[0m[0m policy           = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action   = "route53:ChangeResourceRecordSets"
                      [31m-[0m[0m Effect   = "Allow"
                      [31m-[0m[0m Resource = "arn:aws:route53:::hostedzone/*"
                      [31m-[0m[0m Sid      = "ChangeRecordsInZones"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m Action   = [
                          [31m-[0m[0m "route53:ListTagsForResource",
                          [31m-[0m[0m "route53:ListResourceRecordSets",
                          [31m-[0m[0m "route53:ListHostedZonesByVPC",
                          [31m-[0m[0m "route53:ListHostedZonesByName",
                          [31m-[0m[0m "route53:ListHostedZones",
                          [31m-[0m[0m "route53:GetHostedZone",
                        ]
                      [31m-[0m[0m Effect   = "Allow"
                      [31m-[0m[0m Resource = "*"
                      [31m-[0m[0m Sid      = "ReadAllZones"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m policy_id        = "ANPAQKLMT3VFYS7QEM2T6" [90m-> null[0m[0m
      [31m-[0m[0m tags             = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all         = {
          [31m-[0m[0m "Project" = "eks-lab"
        } [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_role.external_dns[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_role.external_dns is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_role" "external_dns" {
      [31m-[0m[0m arn                   = "arn:aws:iam::022239501643:role/external-dns-role" [90m-> null[0m[0m
      [31m-[0m[0m assume_role_policy    = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [31m-[0m[0m Condition = {
                          [31m-[0m[0m StringEquals = {
                              [31m-[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:aud" = "sts.amazonaws.com"
                              [31m-[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m Federated = "arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F"
                        }
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m create_date           = "2025-07-29T15:47:06Z" [90m-> null[0m[0m
      [31m-[0m[0m force_detach_policies = false [90m-> null[0m[0m
      [31m-[0m[0m id                    = "external-dns-role" [90m-> null[0m[0m
      [31m-[0m[0m managed_policy_arns   = [
          [31m-[0m[0m "arn:aws:iam::022239501643:policy/ExternalDnsPolicy",
        ] [90m-> null[0m[0m
      [31m-[0m[0m max_session_duration  = 3600 [90m-> null[0m[0m
      [31m-[0m[0m name                  = "external-dns-role" [90m-> null[0m[0m
      [31m-[0m[0m path                  = "/" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {
          [31m-[0m[0m "Project" = "eks-lab"
        } [90m-> null[0m[0m
      [31m-[0m[0m unique_id             = "AROAQKLMT3VFXBUKHOGSN" [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_role.external_dns_iam_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "external_dns_iam_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:aud" = "sts.amazonaws.com"
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Federated = "arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "external-dns-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.attach[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_role_policy_attachment.attach is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_role_policy_attachment" "attach" {
      [31m-[0m[0m id         = "external-dns-role-2025072915470702880000000f" [90m-> null[0m[0m
      [31m-[0m[0m policy_arn = "arn:aws:iam::022239501643:policy/ExternalDnsPolicy" [90m-> null[0m[0m
      [31m-[0m[0m role       = "external-dns-role" [90m-> null[0m[0m
    }

[1m  # aws_iam_role_policy_attachment.external_dns_attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "external_dns_attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "external-dns-role"
    }

[1mPlan:[0m 3 to add, 1 to change, 3 to destroy.
[0m
```

*Pusher: @JohnMichaelWalker, Action: `pull_request`*